In [51]:
import pandas as pd
import numpy as np

In [52]:
#parth
circuits = pd.read_csv(r"archive/circuits.csv")
constructor_results = pd.read_csv(r"archive/constructor_results.csv")
constructor_standings = pd.read_csv(r"archive/constructor_standings.csv")
constructors = pd.read_csv(r"archive/constructors.csv")
driver_standings = pd.read_csv(r"archive/driver_standings.csv")
drivers = pd.read_csv(r"archive/drivers.csv")
lap_times = pd.read_csv(r"archive/lap_times.csv")


#me
pit_stops = pd.read_csv(r"archive/pit_stops.csv")
qualifying = pd.read_csv(r"archive/qualifying.csv")
races = pd.read_csv(r"archive/races.csv")
results = pd.read_csv(r"archive/results.csv")
seasons = pd.read_csv(r"archive/seasons.csv")
sprint_results = pd.read_csv(r"archive/sprint_results.csv")
status = pd.read_csv(r"archive/status.csv")

In [53]:
circuits.replace('\\N', np.nan, inplace=True)
circuits.head()

,circuitId,circuitRef,name,location,country,lat,lng,alt,url
0,1,albert_park,Albert Park Grand Prix Circuit,Melbourne,Australia,-37.84970,144.96800,10,http://en.wikipedia.org/wiki/Melbourne_Grand_P...
1,2,sepang,Sepang International Circuit,Kuala Lumpur,Malaysia,2.76083,101.73800,18,http://en.wikipedia.org/wiki/Sepang_Internatio...
2,3,bahrain,Bahrain International Circuit,Sakhir,Bahrain,26.03250,50.51060,7,http://en.wikipedia.org/wiki/Bahrain_Internati...
3,4,catalunya,Circuit de Barcelona-Catalunya,Montmeló,Spain,41.57000,2.26111,109,http://en.wikipedia.org/wiki/Circuit_de_Barcel...
4,5,istanbul,Istanbul Park,Istanbul,Turkey,40.95170,29.40500,130,http://en.wikipedia.org/wiki/Istanbul_Park

In [54]:
constructor_results.replace('\\N', np.nan, inplace=True)
constructor_results.head()

   constructorResultsId  raceId  constructorId  points status
0                     1      18              1    14.0    NaN
1                     2      18              2     8.0    NaN
2                     3      18              3     9.0    NaN
3                     4      18              4     5.0    NaN
4                     5      18              5     2.0    NaN

In [55]:
constructor_standings.replace('\\N', np.nan, inplace=True)
constructor_standings.head()

,constructorStandingsId,raceId,constructorId,points,position,positionText,wins
0,1,18,1,14.0,1,1,1
1,2,18,2,8.0,3,3,0
2,3,18,3,9.0,2,2,0
3,4,18,4,5.0,4,4,0
4,5,18,5,2.0,5,5,0

In [56]:
#No Use in modelling
constructors.replace('\\N', np.nan, inplace=True)

constructors.head()

,constructorId,constructorRef,name,nationality,url
0,1,mclaren,McLaren,British,http://en.wikipedia.org/wiki/McLaren
1,2,bmw_sauber,BMW Sauber,German,http://en.wikipedia.org/wiki/BMW_Sauber
2,3,williams,Williams,British,http://en.wikipedia.org/wiki/Williams_Grand_Pr...
3,4,renault,Renault,French,http://en.wikipedia.org/wiki/Renault_in_Formul...
4,5,toro_rosso,Toro Rosso,Italian,http://en.wikipedia.org/wiki/Scuderia_Toro_Rosso

In [57]:
driver_standings.replace('\\N', np.nan, inplace=True)
driver_standings.head()

   driverStandingsId  raceId  driverId  points  position positionText  wins
0                  1      18         1    10.0         1            1     1
1                  2      18         2     8.0         2            2     0
2                  3      18         3     6.0         3            3     0
3                  4      18         4     5.0         4            4     0
4                  5      18         5     4.0         5            5     0

In [58]:
drivers.replace('\\N', np.nan, inplace=True)
drivers.head()

,driverId,driverRef,number,code,forename,surname,dob,nationality,url
0,1,hamilton,44,HAM,Lewis,Hamilton,1985-01-07,British,http://en.wikipedia.org/wiki/Lewis_Hamilton
1,2,heidfeld,NaN,HEI,Nick,Heidfeld,1977-05-10,German,http://en.wikipedia.org/wiki/Nick_Heidfeld
2,3,rosberg,6,ROS,Nico,Rosberg,1985-06-27,German,http://en.wikipedia.org/wiki/Nico_Rosberg
3,4,alonso,14,ALO,Fernando,Alonso,1981-07-29,Spanish,http://en.wikipedia.org/wiki/Fernando_Alonso
4,5,kovalainen,NaN,KOV,Heikki,Kovalainen,1981-10-19,Finnish,http://en.wikipedia.org/wiki/Heikki_Kovalainen

In [59]:
lap_times.replace('\\N', np.nan, inplace=True)
lap_times.head()

   raceId  driverId  lap  position      time  milliseconds
0     841        20    1         1  1:38.109         98109
1     841        20    2         1  1:33.006         93006
2     841        20    3         1  1:32.713         92713
3     841        20    4         1  1:32.803         92803
4     841        20    5         1  1:32.342         92342

In [60]:
pit_stops.head()

   raceId  driverId  stop  lap      time duration  milliseconds
0     841       153     1    1  17:05:23   26.898         26898
1     841        30     1    1  17:05:52   25.021         25021
2     841        17     1   11  17:20:48   23.426         23426
3     841         4     1   12  17:22:34   23.251         23251
4     841        13     1   13  17:24:10   23.842         23842

In [61]:
qualifying.head()

,qualifyId,raceId,driverId,constructorId,number,position,q1,q2,q3
0,1,18,1,1,22,1,1:26.572,1:25.187,1:26.714
1,2,18,9,2,4,2,1:26.103,1:25.315,1:26.869
2,3,18,5,1,23,3,1:25.664,1:25.452,1:27.079
3,4,18,13,6,2,4,1:25.994,1:25.691,1:27.178
4,5,18,2,2,3,5,1:25.960,1:25.518,1:27.236

In [62]:
races.head()

,raceId,year,round,circuitId,name,date,time,url,fp1_date,fp1_time,fp2_date,fp2_time,fp3_date,fp3_time,quali_date,quali_time,sprint_date,sprint_time
0,1,2009,1,1,Australian Grand Prix,2009-03-29,06:00:00,http://en.wikipedia.org/wiki/2009_Australian_G...,\N,\N,\N,\N,\N,\N,\N,\N,\N,\N
1,2,2009,2,2,Malaysian Grand Prix,2009-04-05,09:00:00,http://en.wikipedia.org/wiki/2009_Malaysian_Gr...,\N,\N,\N,\N,\N,\N,\N,\N,\N,\N
2,3,2009,3,17,Chinese Grand Prix,2009-04-19,07:00:00,http://en.wikipedia.org/wiki/2009_Chinese_Gran...,\N,\N,\N,\N,\N,\N,\N,\N,\N,\N
3,4,2009,4,3,Bahrain Grand Prix,2009-04-26,12:00:00,http://en.wikipedia.org/wiki/2009_Bahrain_Gran...,\N,\N,\N,\N,\N,\N,\N,\N,\N,\N
4,5,2009,5,4,Spanish Grand Prix,2009-05-10,12:00:00,http://en.wikipedia.org/wiki/2009_Spanish_Gran...,\N,\N,\N,\N,\N,\N,\N,\N,\N,\N

In [63]:
results.head()

,resultId,raceId,driverId,constructorId,number,grid,position,positionText,positionOrder,points,laps,time,milliseconds,fastestLap,rank,fastestLapTime,fastestLapSpeed,statusId
0,1,18,1,1,22,1,1,1,1,10.0,58,1:34:50.616,5690616,39,2,1:27.452,218.300,1
1,2,18,2,2,3,5,2,2,2,8.0,58,+5.478,5696094,41,3,1:27.739,217.586,1
2,3,18,3,3,7,7,3,3,3,6.0,58,+8.163,5698779,41,5,1:28.090,216.719,1
3,4,18,4,4,5,11,4,4,4,5.0,58,+17.181,5707797,58,7,1:28.603,215.464,1
4,5,18,5,1,23,3,5,5,5,4.0,58,+18.014,5708630,43,1,1:27.418,218.385,1

In [64]:
seasons.head()

   year                                                url
0  2009  http://en.wikipedia.org/wiki/2009_Formula_One_...
1  2008  http://en.wikipedia.org/wiki/2008_Formula_One_...
2  2007  http://en.wikipedia.org/wiki/2007_Formula_One_...
3  2006  http://en.wikipedia.org/wiki/2006_Formula_One_...
4  2005  http://en.wikipedia.org/wiki/2005_Formula_One_...

In [65]:
sprint_results.head()

,resultId,raceId,driverId,constructorId,number,grid,position,positionText,positionOrder,points,laps,time,milliseconds,fastestLap,fastestLapTime,statusId
0,1,1061,830,9,33,2,1,1,1,3,17,25:38.426,1538426,14,1:30.013,1
1,2,1061,1,131,44,1,2,2,2,2,17,+1.430,1539856,17,1:29.937,1
2,3,1061,822,131,77,3,3,3,3,1,17,+7.502,1545928,17,1:29.958,1
3,4,1061,844,6,16,4,4,4,4,0,17,+11.278,1549704,16,1:30.163,1
4,5,1061,846,1,4,6,5,5,5,0,17,+24.111,1562537,16,1:30.566,1

In [66]:
status.head()

   statusId        status
0         1      Finished
1         2  Disqualified
2         3      Accident
3         4     Collision
4         5        Engine

In [67]:
qualifying.isnull().sum()

qualifyId          0
raceId             0
driverId           0
constructorId      0
number             0
position           0
q1                 8
q2               164
q3               327
dtype: int64

In [68]:
results['position'] = results['position'].replace('\\N', 0)
results['milliseconds'] = results['milliseconds'].replace('\\N', 0)
results['fastestLapTime'] = results['fastestLapTime'].replace('\\N', 0)
results['fastestLapSpeed'] = results['fastestLapSpeed'].replace('\\N', 0)


results['position'] = results['position'].astype(int)
results['milliseconds'] = results['milliseconds'].astype(float)
results['fastestLapSpeed'] = results['fastestLapSpeed'].astype(float)


results['milliseconds'] = results['milliseconds'] / 1000
results = results.rename(columns={'milliseconds': 'seconds'})

In [69]:
results = results.merge(races[['raceId', 'date', 'circuitId']], on='raceId')

In [70]:
results.head()

,resultId,raceId,driverId,constructorId,number,grid,position,positionText,positionOrder,points,laps,time,seconds,fastestLap,rank,fastestLapTime,fastestLapSpeed,statusId,date,circuitId
0,1,18,1,1,22,1,1,1,1,10.0,58,1:34:50.616,5690.616,39,2,1:27.452,218.300,1,2008-03-16,1
1,2,18,2,2,3,5,2,2,2,8.0,58,+5.478,5696.094,41,3,1:27.739,217.586,1,2008-03-16,1
2,3,18,3,3,7,7,3,3,3,6.0,58,+8.163,5698.779,41,5,1:28.090,216.719,1,2008-03-16,1
3,4,18,4,4,5,11,4,4,4,5.0,58,+17.181,5707.797,58,7,1:28.603,215.464,1,2008-03-16,1
4,5,18,5,1,23,3,5,5,5,4.0,58,+18.014,5708.630,43,1,1:27.418,218.385,1,2008-03-16,1

In [71]:
def convert_to_seconds(time_str):
    if pd.isnull(time_str):
        return np.nan
    minutes, seconds = time_str.split(':')
    total_seconds = int(minutes) * 60 + float(seconds)
    return total_seconds

columns = ['q1', 'q2', 'q3']

for column in columns:
    qualifying[column] = qualifying[column].replace('\\N', np.nan)
    qualifying[column] = qualifying[column].apply(convert_to_seconds)

qualifying['Qualifying Time'] = qualifying[['q1', 'q2', 'q3']].mean(axis=1).round(3)

In [72]:
qualifying.head()

,qualifyId,raceId,driverId,constructorId,number,position,q1,q2,q3,Qualifying Time
0,1,18,1,1,22,1,86.572,85.187,86.714,86.158
1,2,18,9,2,4,2,86.103,85.315,86.869,86.096
2,3,18,5,1,23,3,85.664,85.452,87.079,86.065
3,4,18,13,6,2,4,85.994,85.691,87.178,86.288
4,5,18,2,2,3,5,85.960,85.518,87.236,86.238

In [73]:
drivers['age']=2024-(drivers['dob'].str[:4].astype(int))
driver_age=drivers.drop(columns=['driverRef','number','code','forename','surname','dob','nationality','url'])

In [74]:
driver_age.head()

   driverId  age
0         1   39
1         2   47
2         3   39
3         4   43
4         5   43

In [75]:
df_driver_experience = results[['raceId', 'driverId', 'date']].sort_values('date')

df_driver_experience['Driver Experience'] = df_driver_experience.groupby('driverId').cumcount() + 1

In [76]:
df_driver_experience.head()

       raceId  driverId        date  Driver Experience
20155     833       785  1950-05-13                  1
20162     833       666  1950-05-13                  1
20161     833       788  1950-05-13                  1
20160     833       790  1950-05-13                  1
20159     833       661  1950-05-13                  1

In [77]:
df_driver_experience = df_driver_experience.merge(driver_age[["driverId","age"]], on= "driverId")

In [78]:
df_driver_experience.head()

   raceId  driverId        date  Driver Experience  age
0     833       785  1950-05-13                  1  103
1     837       785  1950-06-18                  2  103
2     833       666  1950-05-13                  1  106
3     813       666  1953-07-18                  2  106
4     797       666  1955-07-16                  3  106

In [79]:
df_constructor_experience = results[['raceId', 'constructorId', 'date']].sort_values('date')

df_constructor_experience['Constructor Experience'] = df_constructor_experience.groupby('constructorId').cumcount() + 1

In [80]:
df_constructor_experience.head()

       raceId  constructorId        date  Constructor Experience
20155     833            126  1950-05-13                       1
20162     833            151  1950-05-13                       1
20161     833            105  1950-05-13                       1
20160     833            151  1950-05-13                       2
20159     833            151  1950-05-13                       3

In [81]:
df_driver_constructor_exp = results[['raceId', 'constructorId', 'driverId', 'date']].sort_values('date')

df_driver_constructor_exp['Driver Constructor Experience'] = df_driver_constructor_exp.groupby(['driverId', 'constructorId']).cumcount() + 1

In [82]:
winvision = results[['raceId', 'driverId', 'constructorId', 'grid', 'position', 'laps', 'seconds', 'fastestLapSpeed', 'date', 'circuitId']]

In [83]:
winvision = winvision.merge(df_constructor_experience[['raceId', 'constructorId', 'Constructor Experience']], on=['raceId', 'constructorId'], how='left')

In [84]:
winvision= winvision.merge(df_driver_experience[['raceId', 'driverId', 'Driver Experience',"age"]], on=['raceId', 'driverId'], how='left')

In [85]:
driver_standings.head()

   driverStandingsId  raceId  driverId  points  position positionText  wins
0                  1      18         1    10.0         1            1     1
1                  2      18         2     8.0         2            2     0
2                  3      18         3     6.0         3            3     0
3                  4      18         4     5.0         4            4     0
4                  5      18         5     4.0         5            5     0

In [86]:
driver_standings.rename(columns = {'wins':'driver_wins'}, inplace = True)

In [87]:
driver_standings.head()

,driverStandingsId,raceId,driverId,points,position,positionText,driver_wins
0,1,18,1,10.0,1,1,1
1,2,18,2,8.0,2,2,0
2,3,18,3,6.0,3,3,0
3,4,18,4,5.0,4,4,0
4,5,18,5,4.0,5,5,0

In [88]:
winvision = winvision.merge(driver_standings[['raceId', 'driverId', 'driver_wins']], on=['raceId', 'driverId'], how='left')

In [89]:
constructor_standings.head()

,constructorStandingsId,raceId,constructorId,points,position,positionText,wins
0,1,18,1,14.0,1,1,1
1,2,18,2,8.0,3,3,0
2,3,18,3,9.0,2,2,0
3,4,18,4,5.0,4,4,0
4,5,18,5,2.0,5,5,0

In [90]:
constructor_standings.rename(columns = {'wins':'constructor_wins'}, inplace = True)

In [91]:
winvision = winvision.merge(constructor_standings[['raceId', 'constructorId', 'constructor_wins']], on=['raceId', 'constructorId'], how='left')

In [92]:
winvision.head()

,raceId,driverId,constructorId,grid,position,laps,seconds,fastestLapSpeed,date,circuitId,Constructor Experience,Driver Experience,age,driver_wins,constructor_wins
0,18,1,1,1,1,58,5690.616,218.300,2008-03-16,1,1244,18,39,1.0,1.0
1,18,1,1,1,1,58,5690.616,218.300,2008-03-16,1,1245,18,39,1.0,1.0
2,18,2,2,5,2,58,5696.094,217.586,2008-03-16,1,71,134,47,0.0,0.0
3,18,2,2,5,2,58,5696.094,217.586,2008-03-16,1,72,134,47,0.0,0.0
4,18,3,3,7,3,58,5698.779,216.719,2008-03-16,1,998,36,39,0.0,0.0

In [93]:
winvision = winvision.drop_duplicates(subset=['raceId', 'driverId', 'constructorId'], keep='last')

pos = list(range(1, 21))
winvision = winvision[winvision['position'].isin(pos)]

winvision = winvision[winvision['constructor_wins'].notnull()]

winvision = winvision[winvision['date']>='1980-01-01']

winvision['podium'] = winvision['position'].apply(lambda x: x if 1<=x<=3 else 0)

winvision.to_csv('winvision.csv', index=False)

In [94]:
winvision.head()

,raceId,driverId,constructorId,grid,position,laps,seconds,fastestLapSpeed,date,circuitId,Constructor Experience,Driver Experience,age,driver_wins,constructor_wins,podium
1,18,1,1,1,1,58,5690.616,218.300,2008-03-16,1,1245,18,39,1.0,1.0,1
3,18,2,2,5,2,58,5696.094,217.586,2008-03-16,1,72,134,47,0.0,0.0,2
5,18,3,3,7,3,58,5698.779,216.719,2008-03-16,1,999,36,39,0.0,0.0,3
7,18,4,4,11,4,58,5707.797,215.464,2008-03-16,1,443,106,43,0.0,0.0,0
9,18,5,1,3,5,58,5708.630,218.385,2008-03-16,1,1245,18,43,0.0,1.0,0